Revit 2026 API

# IFCParameterTemplateImportFromFile Method

---

Import mapping template from a text file.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IFCParameterTemplate ImportFromFile(
	Document document,
	string fileName,
	string templateName
)
```
```vb
Public Shared Function ImportFromFile (
	document As Document,
	fileName As String,
	templateName As String
) As IFCParameterTemplate
```
```cpp
public:
static IFCParameterTemplate^ ImportFromFile(
	Document^ document,
	String^ fileName,
	String^ templateName
)
```
```fsharp
static member ImportFromFile :
        document : Document *
        fileName : string *
        templateName : string -> IFCParameterTemplate
```

#### Parameters

document Document
     The Revit document.
fileName String
     The full text file name.
templateName String
     The mapping template name.

#### Return Value

IFCParameterTemplate The mapping template element.

| Exception | Condition |
| --- | --- |
| ArgumentException | The name already exists. |
| ArgumentNullException | A non-optional argument was null |
| FileAccessException | Failed to access the text file. |
| InvalidOperationException | Failed to create IFCParameterTemplate. |

The imported template is saved in the document passed as parameter. The active template of the document remains unchanged.

#### Reference

IFCParameterTemplate Class

Autodesk.Revit.DB Namespace